Tekla Open API Reference for Tekla Structures 2025
ModelObject.SetCustomObjectType Method
 Sets a custom object type name for an existing object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetCustomObjectType(
	string type
)
Public Function SetCustomObjectType (
	type As String
) As Boolean
Parameters
type
Type: System.String
The custom obect type name to set to the model object.
Return Value
Type: Boolean
True on success.
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace